<template>
<div class="rule-container" :style="{ height:RuleHeight, widht:RuleWidth}">
<div class="m-3" style="text-align: justify;">
  <div class="my-4">
      <h5 class="border-bottom pb-2">第１章　名称及び目的</h5>
      <ol>
          <li>本団体は「メディアアートサークルC4’s」と称す。ただし、「C4’s」とはCから始まる4つの英単語を集めたものであり、「シーフォース」と読む。</li>
          <li>本団体は、目的に賛同し自発的に参加する者で組織し、本部を東京理科大学野田校舎内に置く。また、活動内容によって神楽坂校舎、葛飾校舎および学外の任意の場所において制作活動や作品展示などをすることができる。</li>
          <li>本団体は、デジタルコンテンツや電子工作などのメディアアート的創作活動を通じて、会員相互の技術向上を目指すほか、社会のエンターテインメントや利便性向上などに資することを目的とする。</li>
      </ol>
  </div>

  <div class="my-3">
      <h5 class="border-bottom pb-2">第２章　組織</h5>
      <ol>
          <li>本団体は、東京理科大学専任教職員の顧問を置く。</li>
          <li>幹部は部長1名、副部長1名、会計1名により構成するものとする。それぞれの役割は以下のとおり。
              <ol>
                  <li>部長<br>　部長は会員に対し、本会の活動に関して統括するとともに、これらの活動に対して責任を負うものとする。</li>
                  <li>副部長<br>　副部長は、主に部長の業務の補助を行うものとする。</li>
                  <li>会計<br>　会計は、本会におけるいっさいの金銭出納を管理し、責任を負うものとする。</li>
              </ol>
          </li>
          <li>本会に対して大きく貢献したと認められる部長は、退任後に名誉部長としてその功績を称えるものとする。</li>
          <li>すべて幹部は幹部会議によって候補者を選出し、それに対し全会員による総会をもって多数決により決定され、それぞれの引継ぎを行うものとする。</li>
          <li>幹部の任期は12月1日～翌年11月30日までの1年とする。ただし、再任を防げない。</li>
      </ol>
  </div>

  <div class="my-4">
      <h5 class="border-bottom pb-2">第３章　会議・会合</h5>
      <ol>
          <li>総会は本会の最高議決機関とし、毎年2回、部長が招集する定例総会において、次の事項を審議する。
              <ol>
                  <li>会則の制定及び改正に関する事項</li>
                  <li>予算及び決算に関する事項</li>
                  <li>その他、本団体の運営に関する事項</li>
              </ol>
          </li>
          <li>部長は、臨時総会を招集することがある。</li>
          <li>幹部会は、幹部の要請により開く。</li>
      </ol>
  </div>

  <div class="my-4">
      <h5 class="border-bottom pb-2">第４章　会計</h5>
      <ol>
          <li>本団体の会計年度は、4月1日～翌年3月31日までの1年間とする。</li>
          <li>運営費は、会費及びその他収入をもって支弁する。会費は、入会後初年度は4000円(年額)、次年度以降6000円(年額)とする。ただし、幹部会の決定に基づき変更する場合がある。</li>
          <li>会計は、出納帳を作成の上、会計年度毎に収支予想および決算報告書を作成しなければならない。</li>
          <li>会計は、総会において決算報告書を会員に提示し、承認を得なければならない。また、収支予想および決算報告書は東京理科大学学生支援センターへ提出する。</li>
          <li>制作等の活動に必要な物品（ソフト、サービス含む）の購入、サークルの趣旨に沿った展示等への訪問時の補助金（最大1回1人当たり1,000円）、サークル運営のために必要な物・サービス（サーバー代など）の購入に利用する。なお、用途については幹部会の決定に基づき変更する場合がある。</li>
          <li>制作・展示・販売などを通して利益を得た場合、以下に過去の事例を参考として示すが、その利益の分配は、その活動に関わった部員の合意の上で、都度決めることができるものとする。
              <br><span class="text-secondary">【参考】個人制作・販売による収益は、その8割を制作者、2割を部費に分配する。サークル全体として行った活動（学園祭など）による収益は、全額部費に充てる。</span>
          </li>
          <li>第16条に示した用途であれば、部員は役職に関わらず、部費の利用を申請することができる。ただし、部費を利用する場合は、幹部（代表、副代表、会計）のうち2人の合意を得る必要がある。</li>
      </ol>
  </div>

  <div class="my-4">
      <h5 class="border-bottom pb-2">第５章　入部・退部・休部</h5>
      <ol>
          <li>入部を希望する者は、部長にその旨を伝え、本会におけるポータルサイト(以下、「C4’s Portal」)上で部員登録フォームへ入力し、送信する。</li>
          <li>退部する者は、C4’s Portal上で退部フォームへ入力し、送信する。</li>
          <li>6か月以上にわたって活動に参加しない場合、C4’s Portal上で休部フォームへ入力し、送信する。</li>
      </ol>
  </div>

  <p>2023/07/16より施行</p>
</div>
</div>
</template>

<script>
export default {
  name: 'ClubRule',
  props: {
    height: {
      type: String,
      default: '400px'
    },
    width: {
      type: String,
      default: '100%'
    }
  },
  computed: {
    RuleHeight() {
      return this.height;
    },
    RuleWidth() {
      return this.width;
    }
  }
}
</script>

<style scoped>
.rule-container {
  border: 2px solid #ccc;
  padding: 20px;
  border-radius: 10px;
  overflow-y: auto;
  background-color: #fdfdfd;
}
li {
    padding-bottom: 18px;
    line-height: 1.8em;
}

  ol {
      padding-top: 12px;
      padding : 12px 40px 0px 40px;
  }
</style>